title: Authentication from user agent associated with credential harvesting
id: 3a8cbbe3-e8ab-4de1-9a22-222b932557e1
description:
  - Identifies a successful authentication from the user agent 'axios'. Axios is a JavaScript HTTP client that can make HTTP requests from a web browser or Node.js environment. It is commonly abused for credential harvesting tools. This detection likely means a credential harvesting tool has tested the validity of phished credentials and succeeded. A valid session may have been logged and stolen by a credential harvesting tool.
references:
  - https://rigelnoble.com/blogs/cybersecurity/axios-credential-harvesters-detection-and-response/
tags:
  - attack.initial_access
  - attack.resource_development
  - attack.t1586
  - attack.t1566
  - attack.t1078
author: Rigel Noble
date: 2025/07/21
logsource:
  product: azure
  category: signinlogs
detection:
  selection:
    UserAgent|contains:
      - axios
    Operation|equals:
      - UserLoggedIn
  condition: selection
level: critical
falsepositives:
  - Legitimate web applications utilising the Axios user agent.