title: Failed authentication from user agent associated with credential harvesting
id: d5b3ab18-4e82-4c54-8f1b-679f06d99ea6
description:
  - Identifies a failed authentication from the user agent 'axios'. Axios is a JavaScript HTTP client that can make HTTP requests from a web browser or Node.js environment. It is commonly abused for credential harvesting tools. This likely indicates a credential harvester has phished credentials from a user but has failed to sign on successfully.
references:
  - https://rigelnoble.com/blogs/cybersecurity/axios-credential-harvesters-detection-and-response/
tags:
  - attack.initial_access
  - attack.resource_development
  - attack.t1586
  - attack.t1566
  - attack.t1078
author: Rigel Noble
date: 2025/07/21
logsource:
  product: azure
  category: signinlogs
detection:
  selection:
    UserAgent|contains:
      - axios
    Operation|equals:
      - UserLoginFailed
  condition: selection
level: high